case_files/closed/constant/coalCloud1Positions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      coalCloud1Positions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
(0.54 1.93 0.0)
(0.13 1.09 0.0)
(0.35 0.61 0.0)
(0.13 0.79 0.0)
(0.73 1.19 0.0)
(0.84 0.11 0.0)
(0.35 1.38 0.0)
(0.53 1.69 0.0)
(0.49 0.91 0.0)
(0.76 1.32 0.0)
(0.78 0.45 0.0)
(0.98 1.93 0.0)
(0.33 1.24 0.0)
(0.42 1.8 0.0)
(1.0 1.73 0.0)
(0.73 1.61 0.0)
(0.02 1.9 0.0)
(0.5 1.63 0.0)
(0.49 0.68 0.0)
(0.57 0.47 0.0)
(0.03 0.91 0.0)
(0.69 0.18 0.0)
(0.42 0.11 0.0)
(0.6 1.48 0.0)
(0.19 0.07 0.0)
(0.0 0.47 0.0)
(0.5 1.21 0.0)
(0.45 0.23 0.0)
(0.82 1.0 0.0)
(0.38 1.92 0.0)
(0.6 0.68 0.0)
(0.74 1.74 0.0)
(0.33 0.38 0.0)
(0.01 1.7 0.0)
(0.66 0.36 0.0)
(0.44 1.2 0.0)
(0.58 1.86 0.0)
(0.97 1.95 0.0)
(0.5 1.61 0.0)
(0.95 0.46 0.0)
(0.66 1.06 0.0)
(0.49 1.6 0.0)
(0.03 1.91 0.0)
(0.17 0.39 0.0)
(0.92 1.14 0.0)
(0.78 0.56 0.0)
(0.89 0.76 0.0)
(0.57 1.63 0.0)
(0.85 0.82 0.0)
(0.83 1.23 0.0)
(0.31 1.03 0.0)
(0.78 0.32 0.0)
(0.44 0.17 0.0)
(0.36 1.9 0.0)
(0.01 0.05 0.0)
(0.31 1.2 0.0)
(0.19 0.34 0.0)
(0.34 0.13 0.0)
(0.61 0.14 0.0)
(0.23 0.86 0.0)
(0.6 1.62 0.0)
(0.38 0.93 0.0)
(0.46 1.31 0.0)
(0.39 0.62 0.0)
(0.63 1.34 0.0)
(0.46 1.89 0.0)
(0.28 1.98 0.0)
(0.44 0.43 0.0)
(0.05 0.49 0.0)
(0.14 1.75 0.0)
(0.16 1.94 0.0)
(0.57 1.97 0.0)
(0.41 0.14 0.0)
(0.2 1.65 0.0)
(0.72 0.3 0.0)
(0.28 1.31 0.0)
(0.44 1.11 0.0)
(0.28 1.95 0.0)
(0.7 1.2 0.0)
(0.9 0.93 0.0)
(0.82 1.46 0.0)
(0.95 1.14 0.0)
(0.75 1.31 0.0)
(0.71 0.75 0.0)
(0.19 0.03 0.0)
(0.45 0.76 0.0)
(0.04 1.84 0.0)
(0.94 1.56 0.0)
(0.64 1.46 0.0)
(0.69 0.35 0.0)
(0.07 0.24 0.0)
(0.45 0.64 0.0)
(0.62 0.85 0.0)
(0.47 0.63 0.0)
(0.08 0.64 0.0)
(0.75 1.42 0.0)
(0.85 0.29 0.0)
(0.38 0.95 0.0)
(0.33 0.09 0.0)
...
(0.62 -0.19 0.0)

    
)
// ************************************************************************* //
