case_files/closed/constant/coalCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      coalCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    transient       yes;
    coupled         true;
    cellValueSourceCorrection on;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            rho             semiImplicit 1;
            U               semiImplicit 1;
            Yi              semiImplicit 1;
            h               semiImplicit 1;
            radiation       semiImplicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        thermo:mu       cell;
        T               cell;
        Cp              cell;
        kappa           cell;
        p               cell;
        G               cell;
        Ii               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}

constantProperties
{
    rho0            1000;
    T0              300;
    Cp0             1000;
    epsilon0        1;
    f0              0;

    TDevol          483;
    LDevol          3e+5;
    hRetentionCoeff 0.3;

    constantVolume  true;
}

subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
    }

    injectionModels
    {
        model1
        {
            type            manualInjection;
            massTotal   0.1;
            parcelBasisType mass;
            SOI             0;
            positionsFile   "coalCloud1Positions";
            U0              (0 -100 0);
            sizeDistribution
            {
                type        fixedValue; 
                fixedValueDistribution  
                {
                   value	3e-5; }
            }
        }
    }

    dispersionModel stochasticDispersionRAS;

    patchInteractionModel standardWallInteraction;

    heatTransferModel RanzMarshall;

    compositionModel singleMixtureFraction;

    phaseChangeModel liquidEvaporation;

    devolatilisationModel singleKineticRateDevolatilisation; //RateDevolatilisation;

    stochasticCollisionModel none;

    surfaceReactionModel COxidationKineticDiffusionLimitedRate;

    surfaceFilmModel none;

    radiation       on;

    patchInteractionModel standardWallInteraction;

    standardWallInteractionCoeffs
    {
        type            rebound;
        e               1;
        mu              0;
    }

    RanzMarshallCoeffs
    {
        BirdCorrection  true;
    }

    singleMixtureFractionCoeffs
    {
        phases
        (
            gas
            {
                CH4             1;
            }
            liquid
            {
                H2O             1;
            }
            solid
            {
                C               1;
            }
        );
        YGasTot0        0.034;
        YLiquidTot0     0.038;
        YSolidTot0      0.928;
    }

    liquidEvaporationCoeffs
    {
        enthalpyTransfer enthalpyDifference;

        activeLiquids
        (
            H2O
        );
    }

    singleKineticRateDevolatilisationCoeffs
    {
	volatileData
	(	
	   (CH4     9.1e+5 5.53e+7)

	);
	 residualCoeff 0.0001;
    }
    COxidationKineticDiffusionLimitedRateCoeffs
    {
        Sb              1;
        C1              5.0e-12;
        C2              0.005;
        E               7.9e+07;
    }
}

cloudFunctions
{}


// ************************************************************************* //
