case_files/closed/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
source1
{
    type           fixedTemperatureConstraint;

    timeStart       0;
    duration        0.02;
    selectionMode   cellSet;
    cellSet         ignitionCells1;

    mode            uniform;
    temperature     polynomial ((300 0) (1e10 4));
}

// ************************************************************************* //
