case_files/closed/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation on;
//radiationModel  fvDOM;


radiationModel  P1;

P1Coeffs
{
    C               C [0 0 0 0 0 0 0] 0;
}


fvDOMCoeffs
{
    nPhi        3;      // azimuthal angles in PI/2 on X-Y.(from Y to X)
    nTheta      3;      // polar angles in PI (from Z to X-Y plane)
    tolerance   1e-3;   // convergence tolerance for radiation iteration
    maxIter     10;     // maximum number of iterations
}

// Number of flow iterations per radiation iteration
solverFreq 10;

absorptionEmissionModel binaryAbsorptionEmission;

binaryAbsorptionEmissionCoeffs
{
    model1
    {
        absorptionEmissionModel constantAbsorptionEmission;
        constantAbsorptionEmissionCoeffs
        {
            absorptivity    absorptivity    [0 -1 0 0 0 0 0] 0.5;
            emissivity      emissivity      [0 -1 0 0 0 0 0] 0.5;
            E               E   [1 -1 -3 0 0 0 0] 0;
        }
    }
    model2
    {
        absorptionEmissionModel cloudAbsorptionEmission;
        cloudAbsorptionEmissionCoeffs
        {
            cloudNames
            (
                coalCloud1
                limestoneCloud1
            );
        }
    }
}

scatterModel    cloudScatter;

cloudScatterCoeffs
{
    cloudNames
    (
        coalCloud1
        limestoneCloud1
    );
}

transmissivityModel none;

// ************************************************************************* //
