case_files/closed/system/bcCondition
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2012
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/


#include "OpenFOAM/AllDict.h"

void myPatchBC(const dictionary& dict, const Time& time, const dictionary& controlDict, volScalarField& phi)
{
    // Access probe data (assuming probe named "averagePressure")
    volScalarField p_avg = probes::sample(dict, time);
    p_avg = p_avg.subField("p"); // Extract specific field from probes

    // Choose boundary condition based on pressure
    if (p_avg.average() < 3e+5)
    {
        phi.setType(fvPatchField::zeroGradient);
    }
    else
    {
        phi.setType(fvPatchField::outlet);
    }
}













// ************************************************************************* //
