case_files/closed/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2012
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/


probes
{
libs ( "libsampling.so" );

type        probes;

name        probes;

writeControl 	timeStep;
writeInterval 	1;


fields (
        p 
       );

probeLocations
(
   ( 0. 0. 0. )     

);
}
// ************************************************************************* //
